google/myelin-acorn-electron-hardware/a3000_rom_emulator/firmware/hardware/myelin/samd/boards.txt
# Copyright (c) 2014-2017 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

# Myelin Arcflash, based on Adafruit Circuit Playground M0
# --------------------------------------------------------
arcflash.name=Myelin Arcflash
arcflash.vid.0=0x1209
arcflash.pid.0=0xFE07
arcflash.vid.1=0x1209
arcflash.pid.1=0xFE07
arcflash.upload.tool=arduino:bossac
arcflash.upload.protocol=sam-ba
arcflash.upload.maximum_size=262144
arcflash.upload.maximum_data_size=32768
arcflash.upload.use_1200bps_touch=true
arcflash.upload.wait_for_upload_port=true
arcflash.upload.native_usb=true
arcflash.build.mcu=cortex-m0plus
arcflash.build.f_cpu=48000000L
arcflash.build.usb_product="Arcflash"
arcflash.build.usb_manufacturer="Myelin"
arcflash.build.board=SAMD_CIRCUITPLAYGROUND_EXPRESS
arcflash.build.core=arduino:arduino
arcflash.build.extra_flags=-DCRYSTALLESS -DARDUINO_SAMD_ZERO -D__SAMD21G18A__ {build.usb_flags}
arcflash.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
arcflash.build.openocdscript=openocd_scripts/arduino_zero.cfg
arcflash.build.variant=arcflash
arcflash.build.variant_system_lib=
arcflash.build.vid=0x1209
arcflash.build.pid=0xFE07
arcflash.bootloader.tool=arduino:openocd
arcflash.bootloader.file=circuitplay/circuitplay_m0_samd21g18_sam_ba.bin
